# **Combining Location Data and Sentiment Scores for Choropleth Maps**

In [1]:
# Setup dependencies
import pandas as pd
import numpy as np
import pycountry
import us

In [2]:
# Import cleaned news dataset
path = "static/data/choropleth_locations1_clean.csv"
df = pd.read_csv(path)
df

,nid,glocation,pub_date,year,month,weekday
0,2,Louisiana,2015-01-01,2015,January,Thursday
1,3,United States,2015-01-01,2015,January,Thursday
2,5,Boston (Mass),2015-01-01,2015,January,Thursday
3,6,Killeen (Tex),2015-01-01,2015,January,Thursday
4,11,"East Village (Manhattan, NY)",2015-01-01,2015,January,Thursday
...,...,...,...,...,...,...
16283,50563,Denver (Colo),2017-12-31,2017,December,Sunday
16284,50564,Acadia National Park (Me),2017-12-31,2017,December,Sunday
16285,50570,San Francisco (Calif),2017-12-31,2017,December,Sunday
16286,50571,New York State,2017-12-31,2017,December,Sunday
16287,50572,Wichita (Kan),2017-12-31,2017,December,Sunday

In [3]:
# Create columns in main dataframe to add data using API calls
df['country'] = " "
df['state'] = " "
df['latitude'] = " "
df['longitude'] = " "
df = df[['nid', 'glocation', 'country', 'state', 'latitude', 'longitude', 'pub_date', 'year', 'month', 'weekday']]
df

,nid,glocation,country,state,latitude,longitude,pub_date,year,month,weekday
0,2,Louisiana,,,,,2015-01-01,2015,January,Thursday
1,3,United States,,,,,2015-01-01,2015,January,Thursday
2,5,Boston (Mass),,,,,2015-01-01,2015,January,Thursday
3,6,Killeen (Tex),,,,,2015-01-01,2015,January,Thursday
4,11,"East Village (Manhattan, NY)",,,,,2015-01-01,2015,January,Thursday
...,...,...,...,...,...,...,...,...,...,...
16283,50563,Denver (Colo),,,,,2017-12-31,2017,December,Sunday
16284,50564,Acadia National Park (Me),,,,,2017-12-31,2017,December,Sunday
16285,50570,San Francisco (Calif),,,,,2017-12-31,2017,December,Sunday
16286,50571,New York State,,,,,2017-12-31,2017,December,Sunday
16287,50572,Wichita (Kan),,,,,2017-12-31,2017,December,Sunday

In [4]:
# Import data from API calls made for unique locations
path_unique = "static/data/choropleth_locations2_api_unique.csv"
df_unique = pd.read_csv(path_unique)
df_unique

,nid,glocation,country,state,latitude,longitude,pub_date,year,month,weekday
0,2,Louisiana,United States,Louisiana,30.9842977,-91.9623327,1/1/2015,2015,January,Thursday
1,3,United States,United States,,37.09024,-95.712891,1/1/2015,2015,January,Thursday
2,5,Boston (Mass),United States,Massachusetts,42.3600825,-71.0588801,1/1/2015,2015,January,Thursday
3,6,Killeen (Tex),United States,Texas,31.1171194,-97.7277959,1/1/2015,2015,January,Thursday
4,11,"East Village (Manhattan, NY)",United States,New York,40.7264773,-73.9815337,1/1/2015,2015,January,Thursday
...,...,...,...,...,...,...,...,...,...,...
1343,50437,Massena (NY),United States,New York,44.9281049,-74.891865,12/24/2017,2017,December,Sunday
1344,50471,Kearny (NJ),United States,New Jersey,40.7684342,-74.1454214,12/26/2017,2017,December,Tuesday
1345,50511,Sharjah (United Arab Emirates),United Arab Emirates,Sharjah,25.3462553,55.4209317,12/28/2017,2017,December,Thursday
1346,50546,Troy (NY),United States,New York,42.7284117,-73.6917851,12/30/2017,2017,December,Saturday
1347,50564,Acadia National Park (Me),United States,Maine,44.3385559,-68.2733346,12/31/2017,2017,December,Sunday

In [5]:
# Use retrieved data from API calls to populate duplicate locations in dataset
for i in range(len(df)):
    for j in range(len(df_unique)):
        if df['glocation'][i] == df_unique['glocation'][j]:
            df['country'][i] = df_unique['country'][j]
            df['state'][i] = df_unique['state'][j]
            df['latitude'][i] = df_unique['latitude'][j]
            df['longitude'][i] = df_unique['longitude'][j]

df

,nid,glocation,country,state,latitude,longitude,pub_date,year,month,weekday
0,2,Louisiana,United States,Louisiana,30.9842977,-91.9623327,2015-01-01,2015,January,Thursday
1,3,United States,United States,,37.09024,-95.712891,2015-01-01,2015,January,Thursday
2,5,Boston (Mass),United States,Massachusetts,42.3600825,-71.0588801,2015-01-01,2015,January,Thursday
3,6,Killeen (Tex),United States,Texas,31.1171194,-97.7277959,2015-01-01,2015,January,Thursday
4,11,"East Village (Manhattan, NY)",United States,New York,40.7264773,-73.9815337,2015-01-01,2015,January,Thursday
...,...,...,...,...,...,...,...,...,...,...
16283,50563,Denver (Colo),United States,Colorado,39.7392358,-104.990251,2017-12-31,2017,December,Sunday
16284,50564,Acadia National Park (Me),United States,Maine,44.3385559,-68.2733346,2017-12-31,2017,December,Sunday
16285,50570,San Francisco (Calif),United States,California,37.7749295,-122.4194155,2017-12-31,2017,December,Sunday
16286,50571,New York State,United States,New York,43.2994285,-74.2179326,2017-12-31,2017,December,Sunday
16287,50572,Wichita (Kan),United States,Kansas,37.6871761,-97.330053,2017-12-31,2017,December,Sunday

In [9]:
# Drop rows where country name is missing
df = df.replace(r'^\s*$', np.NaN, regex=True)
df = df.dropna(subset=['country'])
df = df.reset_index(drop=True)
df

,nid,glocation,country,state,latitude,longitude,pub_date,year,month,weekday
0,2,Louisiana,United States,Louisiana,30.9842977,-91.9623327,2015-01-01,2015,January,Thursday
1,3,United States,United States,NaN,37.09024,-95.712891,2015-01-01,2015,January,Thursday
2,5,Boston (Mass),United States,Massachusetts,42.3600825,-71.0588801,2015-01-01,2015,January,Thursday
3,6,Killeen (Tex),United States,Texas,31.1171194,-97.7277959,2015-01-01,2015,January,Thursday
4,11,"East Village (Manhattan, NY)",United States,New York,40.7264773,-73.9815337,2015-01-01,2015,January,Thursday
...,...,...,...,...,...,...,...,...,...,...
15625,50563,Denver (Colo),United States,Colorado,39.7392358,-104.990251,2017-12-31,2017,December,Sunday
15626,50564,Acadia National Park (Me),United States,Maine,44.3385559,-68.2733346,2017-12-31,2017,December,Sunday
15627,50570,San Francisco (Calif),United States,California,37.7749295,-122.4194155,2017-12-31,2017,December,Sunday
15628,50571,New York State,United States,New York,43.2994285,-74.2179326,2017-12-31,2017,December,Sunday
15629,50572,Wichita (Kan),United States,Kansas,37.6871761,-97.330053,2017-12-31,2017,December,Sunday

In [10]:
# Import sentiment scores
path_scores = "static/data/headlines_scores_keywords.csv"
df_scores = pd.read_csv(path_scores)
df_scores

,nid,headline,article,headline_score,article_score,pub_date,section_name,news_desk,organizations,persons,subject,glocations,creative_works,abs_headline_score,abs_article_score
0,1,"Standouts in Tech: Drones, Virtual Reality, In...",LOTS of cool new technology products come out ...,0.0000,0.16550,1/1/2015,Technology,Business,"['Oculus VR Inc', 'Skype Technologies', 'DJI I...","['Manjoo, Farhad']","['Virtual Reality (Computers)', 'Computers and...",[],[],0.0000,0.16550
1,2,Much of David Duke's '91 Campaign Is Now in Lo...,"BATON ROUGE, La. — David Duke seems a figure f...",0.0000,0.12800,1/1/2015,U.S.,National,[],"['Alford, Jeremy', 'Duke, David E', 'Scalise, ...","['Blacks', 'Black People', 'Race and Ethnicity...",['Louisiana'],[],0.0000,0.12800
2,3,"States' Minimum Wages Rise, Helping Millions o...","For some low-wage workers, everyday tasks like...",0.2960,-0.05160,1/1/2015,Business Day,Business,[],[],"['Minimum Wage', 'States (US)']",['United States'],[],0.2960,0.05160
3,4,New C.D.C. Job Overseeing Laboratory Safety,A new job title — chief of laboratory safety —...,0.4215,0.04162,1/1/2015,Health,National,['Centers for Disease Control and Prevention'],"['McNeil, Donald G Jr', 'Frieden, Thomas R']","['Ebola Virus', 'Laboratories and Scientific E...",[],[],0.4215,0.04162
4,5,Massachusetts: New Effort to Move Bombings Trial,"Lawyers for Dzhokhar Tsarnaev, the defendant i...",0.0000,-0.29145,1/1/2015,U.S.,National,[],"['Tsarnaev, Dzhokhar A']",['Boston Marathon Bombings (2013)'],['Boston (Mass)'],[],0.0000,0.29145
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
50567,50568,How Do You Turn an Ad Into a Meme? Two Words: ...,"In 1995, a nation was rapt as three frogs croa...",0.0000,0.44040,12/31/2017,Business Day,Business,['Anheuser-Busch InBev NV'],[],"['ADVERTISING AND MARKETING', 'Beer']",[],[],0.0000,0.44040
50568,50569,"Partisans, Wielding Money, Begin Seeking to Ex...",WASHINGTON — As the #MeToo movement to expose ...,-0.5994,-0.61240,12/31/2017,U.S.,National,[],"['Allred, Gloria', 'Bloom, Lisa (1961- )', 'Ce...","['United States Politics and Government', '#Me...",[],[],0.5994,0.61240
50569,50570,How Do You Vote? 50 Million Google Images Give...,What vehicle is most strongly associated with ...,0.0000,0.33840,12/31/2017,Technology,Business,"['Google Street View', 'Stanford University']",[],"['Artificial Intelligence', 'Data-Mining and D...","['Casper (Wyo)', 'Burlington (Vt)', 'Chicago (...",[],0.0000,0.33840
50570,50571,Democrats in High-Tax States Plot to Blunt Imp...,"Democrats in high-cost, high-tax states are pl...",0.0000,0.00000,12/31/2017,Business Day,Business,"['Democratic Party', 'Republican Party']",[],"['Tax Credits, Deductions and Exemptions', 'Ta...","['California', 'Connecticut', 'New Jersey', 'N...",[],0.0000,0.00000
50571,50572,Fatal 'Swatting' Episode in Kansas Raises Quan...,"When the police surrounded a house in Wichita,...",-0.7096,0.00000,12/31/2017,U.S.,National,[],"['Finch, Andrew (1989-2017)', 'Barriss, Tyler R']","['Police Brutality, Misconduct and Shootings',...",['Wichita (Kan)'],[],0.7096,0.00000

In [11]:
# Add scores to locations dataframe
df['headline_score'] = " "
df['article_score'] = " "
df = df[['nid', 'country', 'state', 'year', 'month', 'weekday', 'headline_score', 'article_score']] 
df

,nid,country,state,year,month,weekday,headline_score,article_score
0,2,United States,Louisiana,2015,January,Thursday,,
1,3,United States,NaN,2015,January,Thursday,,
2,5,United States,Massachusetts,2015,January,Thursday,,
3,6,United States,Texas,2015,January,Thursday,,
4,11,United States,New York,2015,January,Thursday,,
...,...,...,...,...,...,...,...,...
15625,50563,United States,Colorado,2017,December,Sunday,,
15626,50564,United States,Maine,2017,December,Sunday,,
15627,50570,United States,California,2017,December,Sunday,,
15628,50571,United States,New York,2017,December,Sunday,,
15629,50572,United States,Kansas,2017,December,Sunday,,

In [12]:
# Fetch headline and article sentiment scores for countries dataset
df['headline_score'] = df.nid.map(df_scores.set_index('nid')['headline_score'].to_dict())
df['article_score'] = df.nid.map(df_scores.set_index('nid')['article_score'].to_dict())
df.head()

,nid,country,state,year,month,weekday,headline_score,article_score
0,2,United States,Louisiana,2015,January,Thursday,0.000,0.12800
1,3,United States,NaN,2015,January,Thursday,0.296,-0.05160
2,5,United States,Massachusetts,2015,January,Thursday,0.000,-0.29145
3,6,United States,Texas,2015,January,Thursday,0.000,-0.67050
4,11,United States,New York,2015,January,Thursday,0.000,0.58590

In [13]:
# Add country code and state code columns to dataframe
df['country_ISO_code'] = " "
df['US_state_code'] = " "
df = df[['nid', 'country', 'country_ISO_code', 'state', 'US_state_code', 'year', 'month', 'weekday', 'headline_score', 'article_score']] 
df

,nid,country,country_ISO_code,state,US_state_code,year,month,weekday,headline_score,article_score
0,2,United States,,Louisiana,,2015,January,Thursday,0.0000,0.128000
1,3,United States,,NaN,,2015,January,Thursday,0.2960,-0.051600
2,5,United States,,Massachusetts,,2015,January,Thursday,0.0000,-0.291450
3,6,United States,,Texas,,2015,January,Thursday,0.0000,-0.670500
4,11,United States,,New York,,2015,January,Thursday,0.0000,0.585900
...,...,...,...,...,...,...,...,...,...,...
15625,50563,United States,,Colorado,,2017,December,Sunday,-0.6369,-0.630833
15626,50564,United States,,Maine,,2017,December,Sunday,-0.5023,0.700300
15627,50570,United States,,California,,2017,December,Sunday,0.0000,0.338400
15628,50571,United States,,New York,,2017,December,Sunday,0.0000,0.000000
15629,50572,United States,,Kansas,,2017,December,Sunday,-0.7096,0.000000

In [16]:
# Get ISO country codes from "pycountry" library
# Get US state codes from "us" library

for i in range(len(df)):
    country = df['country'][i]
    try:
        result_c = pycountry.countries.search_fuzzy(country)[0].alpha_3 
    except:
        result_c = np.NaN
    df['country_ISO_code'][i] = result_c   


    state = df['state'][i]
    try:
        result_s = us.states.lookup(state).abbr
    except:  
        result_s = np.NaN  
    df['US_state_code'][i] = result_s
    
df

,nid,country,country_ISO_code,state,US_state_code,year,month,weekday,headline_score,article_score
0,2,United States,USA,Louisiana,LA,2015,January,Thursday,0.0000,0.128000
1,3,United States,USA,NaN,NaN,2015,January,Thursday,0.2960,-0.051600
2,5,United States,USA,Massachusetts,MA,2015,January,Thursday,0.0000,-0.291450
3,6,United States,USA,Texas,TX,2015,January,Thursday,0.0000,-0.670500
4,11,United States,USA,New York,NY,2015,January,Thursday,0.0000,0.585900
...,...,...,...,...,...,...,...,...,...,...
15625,50563,United States,USA,Colorado,CO,2017,December,Sunday,-0.6369,-0.630833
15626,50564,United States,USA,Maine,ME,2017,December,Sunday,-0.5023,0.700300
15627,50570,United States,USA,California,CA,2017,December,Sunday,0.0000,0.338400
15628,50571,United States,USA,New York,NY,2017,December,Sunday,0.0000,0.000000
15629,50572,United States,USA,Kansas,KS,2017,December,Sunday,-0.7096,0.000000

In [18]:
# Convert to CSV to save news location data with sentiment data and dates

df.to_csv("static/data/choropleth_locations3_all_sentiment.csv", index=False)